export // 成就系统
  const achieveList = [
    {
      name: "杂鱼大叔",
      msg: ["怎么了杂鱼大叔~♥ 你已经钓满十条杂鱼了哦~\n 果然要给你一下奖励呢！", "对于经常钓到杂鱼的大叔的嘉奖。继续努力吧~ 杂鱼大叔"],
      info: "佩戴后，钓鱼的收获环节会增加两倍钓到 杂鱼 的概率",
      need: [{ name: "杂鱼", num: 10 }],
      upProb: [{ name: "杂鱼", up: 2 }]
    },
    {
      name: "多宝鱼专家",
      msg: ["多次成功钓上多宝鱼，你已经充分有捕获它的经验了！", "你已经掌握了捕捞多宝鱼的技巧"],
      info: "佩戴后，钓鱼的收获环节会增加两倍钓到 多宝鱼 的概率",
      need: [{ name: "多宝鱼", num: 10 }],
      upProb: [{ name: "多宝鱼", up: 2 }]
    },
    {
      name: "入门专家",
      msg: ["餐桌上常见的鱼，你已经出的习以为常了。掌握了这门技术", "你已经掌握了捕捞常见的鱼的技巧"],
      info: "佩戴后，钓鱼的收获环节会增加两倍钓到 鲤鱼、生鱼、鲫鱼 的概率",
      need: [{ name: "鲤鱼", num: 10 }, { name: "生鱼", num: 10 }, { name: "鲫鱼", num: 10 }],
      upProb: [{ name: "鲤鱼", up: 2 }, { name: "生鱼", up: 2 }, { name: "鲫鱼", up: 2 }]
    },
    {
      name: "龟男",
      msg: ["钓到了不少乌龟了,做的好!已经不错了"],
      info: "佩戴后，钓鱼的收获环节会增加三倍钓到 乌龟 的概率",
      need: [{ name: "乌龟", num: 10 }],
      upProb: [{ name: "乌龟", up: 3 }]
    },
    {
      name: "KFC推销员",
      msg: ["看你钓了不少KFC鱼，想必也是特意这样做的吧？那就送你这个称号吧！", "失败是成功之母；VW50，你就是成功支付！\n\n嗯！既然你愿意这样钓这么多这条鱼，应该也有你的想法！送你了，这个称号！"],
      info: "佩戴后，钓鱼的收获环节会增加两倍钓到 VW50鱼 的概率",
      need: [{ name: "VW50鱼", num: 10 }],
      upProb: [{ name: "VW50鱼", up: 2 }]
    }
  ]